# Pandas

Pandas offers high level data structures like `Series` and `DataFrame` that make data analysis easy in Python. These data structures are built on top of `ndarrays`. Therefore, much of the functionalities are similar between them and you can use same functions on `ndarray`, `Series`, and `DataFrame`.

In [1]:
import numpy as np
import pandas as pd

## Series
A `Series` is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its `Index`.

### Series Initialization
By default, `Series` assigns numbers 0 to N-1 as labels for the data.

In [4]:
series1 = pd.Series([1,2,3,4,5])
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
series1.index

RangeIndex(start=0, stop=5, step=1)

However, we can also assign our own labels.

In [6]:
series2 = pd.Series([12000, 17000, 1100], index=['January', 'February', 'October'])
series2

January     12000
February    17000
October      1100
dtype: int64

In [8]:
series2.index = ['January', 'March', 'October']
series2

January    12000
March      17000
October     1100
dtype: int64

We can also use a dictionary to create a `Series`.

In [11]:
dic = {
    'a': 'Hello',
    'b': 'Pandas',
    'c': 'Series'
}
series3 = pd.Series(dic)
series3

a     Hello
b    Pandas
c    Series
dtype: object

In [20]:
'c' in series3

True

A `Series` can have a name. So can the the `Index` of the Series.

In [21]:
series3.name = 'Words'
series3.index.name = 'Index'
series3

Index
a     Hello
b    Pandas
c    Series
Name: Words, dtype: object

We can also convert a `Series` into a `ndarray`.

In [22]:
series2.values

array([12000, 17000,  1100])

### Indexing and Slicing

We can use all the indexing and slicing mechanisms of `Python` and `NumPy`. In addition, we can use the `Index` of a `Series` to index or slice a `Series`.

In [24]:
print(series2)
series2.index

January    12000
March      17000
October     1100
dtype: int64

Index(['January', 'March', 'October'], dtype='object')

In [33]:
series2['March']

17000

In [34]:
series2[['January', 'October']]

January    12000
October     1100
dtype: int64

In [35]:
series2['January': 'October']

January    12000
March      17000
October     1100
dtype: int64

In [25]:
series2[1]

17000

In [30]:
series2[[0, 1]]

January    12000
March      17000
dtype: int64

In [46]:
series2[1:]

March      17000
October     1100
dtype: int64

In [32]:
series2[series2 > 10000]

January    12000
March      17000
dtype: int64

### Null Values

In [47]:
series4 = pd.Series(['Hello', 'Pandas', 'Series', np.nan], index=['a', 'b', 'c', 'd'])
series4

a     Hello
b    Pandas
c    Series
d       NaN
dtype: object

In [48]:
series4.isnull()

a    False
b    False
c    False
d     True
dtype: bool

In [49]:
series4[series4.isnull()]

d    NaN
dtype: object

In [50]:
series4[series4.isnull()] = 'Something'
series4

a        Hello
b       Pandas
c       Series
d    Something
dtype: object

In [51]:
series4.isnull()

a    False
b    False
c    False
d    False
dtype: bool

## DataFrame

You can think of it like a list of `Series`. This the main data structure for working with tabular data.

In [54]:
dic = {
    'feature1': [21, 32, 33, 55],
    'feature2': [1, 6, 7, 3],
    'feature3': [12, 34, 45, 67]
}

df = pd.DataFrame(dic)
df

   feature1  feature2  feature3
0        21         1        12
1        32         6        34
2        33         7        45
3        55         3        67

We can access columns of a `DataFrame` by using dictionary like indexing. Notice that the index of the output Series is same as the `DataFrame`.

In [58]:
df.feature1

0    21
1    32
2    33
3    55
Name: feature1, dtype: int64

In [59]:
df['feature2']

0    1
1    6
2    7
3    3
Name: feature2, dtype: int64

We can create and delete a new feature using dictionary like style.

In [60]:
df['feature4'] = [145, 155, 167, 159]
df

   feature1  feature2  feature3  feature4
0        21         1        12       145
1        32         6        34       155
2        33         7        45       167
3        55         3        67       159

In [61]:
del df['feature4']
df

   feature1  feature2  feature3
0        21         1        12
1        32         6        34
2        33         7        45
3        55         3        67

We can update the value of any specific cell in the `DataFrame`.

In [63]:
df.feature3[2] = 100
df

   feature1  feature2  feature3
0        21         1        12
1        32         6        34
2        33         7       100
3        55         3        67

### Indexing and Slicing

In [64]:
df[df.feature1 > 25]

   feature1  feature2  feature3
1        32         6        34
2        33         7       100
3        55         3        67

In [65]:
df[(df.feature3 == 100) | (df.feature1 == 55)]

   feature1  feature2  feature3
2        33         7       100
3        55         3        67

In [70]:
df.loc[(df.feature3 == 100) | (df.feature1 == 55), ['feature2', 'feature3']]

   feature2  feature3
2         7       100
3         3        67

In [85]:
df.iloc[0:2, [1, 0]]

   feature2  feature1
0         1        21
1         6        32

In [84]:
df.iloc[0, 2]

12

## Data Loading

- **`read_csv`**: Loads data from a file or URL using comma as default delimiter. Please read details in [read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)
- **`read_table`**: Loads data from a file or URL using tab as default delimiter. Please read details in [read_table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_table.html)
- **`read_json`**: Reads JSON files. Please read details in [read_json](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_json.html)
- **`read_excel`**: Reads XLSX files. Please read details in [read_excel](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html)
- **`open`**: To open any file using plain Python. Please read details in [Python File IO](https://docs.python.org/3/tutorial/inputoutput.html#reading-and-writing-files)

### Data Loading Examples (CSV/TSV Files)

`Pandas` usually infers data type automatically, assumes top row is the header row, and creates index automatically.

In [86]:
dummy = pd.read_csv('./Data/dummy1.csv')
dummy.head(5)

   feature1  feature2  feature3  feature4  feature5 feature6
0        12        33        22        12         4    Hello
1        12        32        15        17         3    World
2         5        12        34        32        12     Blah
3         7        19        32        44        33    Hello
4        12        15        16        32        45    World

However, you can choose any specific column to be the index of the `DataFrame`. Also notice that there is actually no difference between `read_csv` and `read_table` except for `sep` parameter.

In [87]:
dummy = pd.read_table('./Data/dummy1.csv', index_col='feature5', sep=',')
dummy.head()

          feature1  feature2  feature3  feature4 feature6
feature5
4               12        33        22        12    Hello
3               12        32        15        17    World
12               5        12        34        32     Blah
33               7        19        32        44    Hello
45              12        15        16        32    World

If your dataset does not have any header, tell Pandas. Otherwise, it will use the first observation as a header.

In [90]:
dummy = pd.read_csv('./Data/dummy2.csv')
dummy.tail(2)

   12  33  22  12.1   4  Hello
3  12  15  16    32  45  World
4  19  43  12    32  53   Blah

If you tell pandas that there is no header, it will assign some random header.

In [99]:
dummy = pd.read_csv('./Data/dummy2.csv', header=None)
dummy

    0   1   2   3   4      5
0  12  33  22  12   4  Hello
1  12  32  15  17   3  World
2   5  12  34  32  12   Blah
3   7  19  32  44  33  Hello
4  12  15  16  32  45  World
5  19  43  12  32  53   Blah

You can supply your preferred column names if you want.

In [103]:
names = ['feature' + str(i) for i in range(1, 7)]
print(names)

dummy = pd.read_csv('./Data/dummy2.csv', header=None, names=names)
dummy.sample(n=3)

['feature1', 'feature2', 'feature3', 'feature4', 'feature5', 'feature6']

   feature1  feature2  feature3  feature4  feature5 feature6
0        12        33        22        12         4    Hello
1        12        32        15        17         3    World
2         5        12        34        32        12     Blah

### Data Loading Examples (Excel Files)
My personal suggestion is to avoid excel as much as possible if you are going to work with Python.

In [104]:
dummy = pd.read_excel('./Data/dummy.xlsx', sheet_name=0)
dummy.iloc[1:5]

   feature1  feature2  feature3  feature4  feature5 feature6
1        12        32        15        17         3    World
2         5        12        34        32        12     Blah
3         7        19        32        44        33    Hello
4        12        15        16        32        45    World

In [107]:
sheets = pd.ExcelFile('./Data/dummy.xlsx')
dummy1 = pd.read_excel(sheets, 'dummy1')
dummy1.tail()

   feature1  feature2  feature3  feature4  feature5 feature6
1        12        32        15        17         3    World
2         5        12        34        32        12     Blah
3         7        19        32        44        33    Hello
4        12        15        16        32        45    World
5        19        43        12        32        53     Blah

### Data Loading Examples (JSON)

In [109]:
dummy = pd.read_json('./Data/dummy.json')
dummy

   feature1  feature2  feature3  feature4  feature5 feature6
0        12        33        22        12         4    Hello
1        12        32        15        17         3    World
2         5        12        34        32        12     Blah
3         7        19        32        44        33    Hello
4        12        15        16        32        45    World
5        19        43        12        32        53     Blah

In [110]:
dummy.to_csv('./Data/new_data.csv')